In [1]:
import pandas as pd
import mysql.connector
import os

# List of CSV files and their corresponding table names
csv_files = [
    ('customers.csv', 'customers'),
    ('orders.csv', 'orders'),
    ('sellers.csv', 'sellers'),
    ('products.csv', 'products'),
    ('geolocation.csv', 'geolocation'),
    ('payments.csv', 'payments'),
    ('order_items.csv','order_items')# Added payments.csv for specific handling
]

# Connect to the MySQL database
conn = mysql.connector.connect(
    host='localhost',
    user='root',
    password='Ketki5@mysql',
    database='ecommerce'
)
cursor = conn.cursor()

# Folder containing the CSV files
folder_path = 'C:/Users/prana/OneDrive/Desktop/E-Commerce'

def get_sql_type(dtype):
    if pd.api.types.is_integer_dtype(dtype):
        return 'INT'
    elif pd.api.types.is_float_dtype(dtype):
        return 'FLOAT'
    elif pd.api.types.is_bool_dtype(dtype):
        return 'BOOLEAN'
    elif pd.api.types.is_datetime64_any_dtype(dtype):
        return 'DATETIME'
    else:
        return 'TEXT'

for csv_file, table_name in csv_files:
    file_path = os.path.join(folder_path, csv_file)
    
    # Read the CSV file into a pandas DataFrame
    df = pd.read_csv(file_path)
    
    # Replace NaN with None to handle SQL NULL
    df = df.where(pd.notnull(df), None)
    
    # Debugging: Check for NaN values
    print(f"Processing {csv_file}")
    print(f"NaN values before replacement:\n{df.isnull().sum()}\n")

    # Clean column names
    df.columns = [col.replace(' ', '_').replace('-', '_').replace('.', '_') for col in df.columns]

    # Generate the CREATE TABLE statement with appropriate data types
    columns = ', '.join([f'`{col}` {get_sql_type(df[col].dtype)}' for col in df.columns])
    create_table_query = f'CREATE TABLE IF NOT EXISTS `{table_name}` ({columns})'
    cursor.execute(create_table_query)

    # Insert DataFrame data into the MySQL table
    for _, row in df.iterrows():
        # Convert row to tuple and handle NaN/None explicitly
        values = tuple(None if pd.isna(x) else x for x in row)
        sql = f"INSERT INTO `{table_name}` ({', '.join(['`' + col + '`' for col in df.columns])}) VALUES ({', '.join(['%s'] * len(row))})"
        cursor.execute(sql, values)

    # Commit the transaction for the current CSV file
    conn.commit()

# Close the connection
conn.close()

Processing customers.csv
NaN values before replacement:
customer_id                 0
customer_unique_id          0
customer_zip_code_prefix    0
customer_city               0
customer_state              0
dtype: int64

Processing orders.csv
NaN values before replacement:
order_id                            0
customer_id                         0
order_status                        0
order_purchase_timestamp            0
order_approved_at                 160
order_delivered_carrier_date     1783
order_delivered_customer_date    2965
order_estimated_delivery_date       0
dtype: int64

Processing sellers.csv
NaN values before replacement:
seller_id                 0
seller_zip_code_prefix    0
seller_city               0
seller_state              0
dtype: int64

Processing products.csv
NaN values before replacement:
product_id                      0
product category              610
product_name_length           610
product_description_length    610
product_photos_qty            610
product_weight_g                2
product_length_cm               2
product_height_cm               2
product_width_cm                2
dtype: int64

Processing geolocation.csv
NaN values before replacement:
geolocation_zip_code_prefix    0
geolocation_lat                0
geolocation_lng                0
geolocation_city               0
geolocation_state              0
dtype: int64

Processing payments.csv
NaN values before replacement:
order_id                0
payment_sequential      0
payment_type            0
payment_installments    0
payment_value           0
dtype: int64

Processing order_items.csv
NaN values before replacement:
order_id               0
order_item_id          0
product_id             0
seller_id              0
shipping_limit_date    0
price                  0
freight_value          0
dtype: int64

In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import mysql.connector
import numpy as np

db = mysql.connector.connect(host = "localhost",
                             username = "root",
                             password = "Ketki5@mysql",
                             database = "ecommerce")

cur = db.cursor()

# List all unique cities where customers are located.

In [13]:
query = """ select distinct customer_city from customers """

cur.execute(query)
data = cur.fetchall()
df = pd.DataFrame(data, columns = ["Cities"])
df.head(10)

                  Cities
0                 franca
1  sao bernardo do campo
2              sao paulo
3        mogi das cruzes
4               campinas
5         jaragua do sul
6                timoteo
7               curitiba
8         belo horizonte
9          montes claros

# Count the number of orders placed in 2017.

In [6]:
query = """ select count(order_id) from orders where year(order_purchase_timestamp) = 2017 """

cur.execute(query)
data = cur.fetchall()
print(data)
"Total orders placed in 2017 are", data[0][0]

[(45101,)]

('Total orders placed in 2017 are', 45101)

# Find the total sales per category.

In [5]:
query = """ select products.product_category category, round(sum(payments.payment_value),2) sales
from products join order_items
on products.product_id = order_items.product_id
join payments
on payments.order_id = order_items.order_id
group by category """

cur.execute(query)
data = cur.fetchall()
df = pd.DataFrame(data, columns = ["Category","Sales"])
df

                       Category       Sales
0                     perfumery   506738.66
1          Furniture Decoration  1430176.39
2                     telephony   486882.05
3                bed table bath  1712553.67
4                    automotive   852294.33
..                          ...         ...
69               cds music dvds     1199.43
70                   La Cuisine     2913.53
71  Fashion Children's Clothing      785.67
72                     PC Gamer     2174.43
73       insurance and services      324.51

[74 rows x 2 columns]

In [10]:
query = """ select sum(case when payment_installments >= 1 then 1 
else 0 end)/count(*)*100 from payments """

cur.execute(query)
data = cur.fetchall()
df = pd.DataFrame(data, columns = ["%_of_orders_paid_in_installments"])
print(df)
"Percentage of orders that were paid in installments is",data[0][0]

  %_of_orders_paid_in_installments
0                          99.9981

('Percentage of orders that were paid in installments is', Decimal('99.9981'))

# Count the number of customers from each state.

In [11]:
query = """ select customer_state, count(customer_id) 
from customers group by customer_state """

cur.execute(query)
data = cur.fetchall()
df = pd.DataFrame(data, columns = ["State","Total Customers"])
df

   State  Total Customers
0     SP            41746
1     SC             3637
2     MG            11635
3     PR             5045
4     RJ            12852
5     RS             5466
6     PA              975
7     GO             2020
8     ES             2033
9     BA             3380
10    MA              747
11    MS              715
12    CE             1336
13    DF             2140
14    RN              485
15    PE             1652
16    MT              907
17    AM              148
18    AP               68
19    AL              413
20    RO              253
21    PB              536
22    TO              280
23    PI              495
24    AC               81
25    SE              350
26    RR               46

# Calculate the number of orders per month in 2018

In [16]:
query = """ select monthname(order_purchase_timestamp) "Month", count(order_id) 
from orders where year(order_purchase_timestamp) = 2018 group by Month """

cur.execute(query)
data = cur.fetchall()
df = pd.DataFrame(data, columns = ["Month","Order Count"])
df

       Month  Order Count
0       July         6292
1     August         6512
2   February         6728
3       June         6167
4      March         7211
5    January         7269
6        May         6873
7      April         6939
8  September           16
9    October            4

# Find the average number of products per order, grouped by customer city.

In [20]:
query = """ with count_per_order as
(select orders.order_id, orders.customer_id, count(order_items.order_id) oc
from orders join order_items
on orders.order_id = order_items.order_id
group by orders.order_id, orders.customer_id)

select customers.customer_city, round(avg(count_per_order.oc),2) "Average Orders"
from customers join count_per_order
on customers.customer_id = count_per_order.customer_id
group by customers.customer_city
order by round(avg(count_per_order.oc),2) desc """

cur.execute(query)
data = cur.fetchall()
df = pd.DataFrame(data, columns = ["City","Average Orders"])
df.head(10)

                 City Average Orders
0      padre carvalho           7.00
1         celso ramos           6.50
2               datas           6.00
3       candido godoi           6.00
4      matias olimpio           5.00
5          cidelandia           4.00
6             picarra           4.00
7  morro de sao paulo           4.00
8     teixeira soares           4.00
9          curralinho           4.00

# Calculate the percentage of total revenue contributed by each product category.

In [23]:
query = """ select products.product_category category, 
round((sum(payments.payment_value)/(select sum(payment_value) from payments))*100,2) sales_percentage
from products join order_items
on products.product_id = order_items.product_id
join payments
on payments.order_id = order_items.order_id
group by category
order by sales_percentage desc"""

cur.execute(query)
data = cur.fetchall()
df = pd.DataFrame(data, columns = ["Category","Sales Percentage"])
df

                       Category  Sales Percentage
0                bed table bath             10.70
1                 HEALTH BEAUTY             10.35
2          computer accessories              9.90
3          Furniture Decoration              8.93
4               Watches present              8.93
..                          ...               ...
69              House Comfort 2              0.01
70               cds music dvds              0.01
71                     PC Gamer              0.01
72  Fashion Children's Clothing              0.00
73       insurance and services              0.00

[74 rows x 2 columns]

# Identify the correlation between product price and the number of times a product has been purchased.

In [29]:
query = """ select products.product_category,
count(order_items.product_id) order_count,
round(avg(order_items.price),2) avg_price
from products join order_items
on products.product_id = order_items.product_id
group by products.product_category"""

cur.execute(query)
data = cur.fetchall()
df = pd.DataFrame(data, columns = ["Category","Order Count","Average Price"])
print(df)

arr1 = df["Order Count"]
arr2 = df["Average Price"]
np.corrcoef([arr1,arr2])

                           Category  Order Count  Average Price
0                     HEALTH BEAUTY         9670         130.16
1                     sport leisure         8641         114.34
2                        Cool Stuff         3796         167.36
3              computer accessories         7827         116.51
4                   Watches present         5991         201.14
..                              ...          ...            ...
69                          flowers           33          33.64
70  Kitchen portable and food coach           15         264.57
71                  House Comfort 2           30          25.34
72       CITTE AND UPHACK FURNITURE           38         114.95
73                   cds music dvds           14          52.14

[74 rows x 3 columns]

array([[ 1.        , -0.10631514],
       [-0.10631514,  1.        ]])

# Calculate the total revenue generated by each seller, and rank them by revenue.

In [34]:
query = """ select *, dense_rank() over(order by revenue desc) rnk from
(select order_items.seller_id, round(sum(payments.payment_value),2) revenue
from order_items join payments
on order_items.order_id = payments.order_id
group by order_items.seller_id) as a """

cur.execute(query)
data = cur.fetchall()
df = pd.DataFrame(data, columns = ["seller_id","revenue","rank"])
df.head(10)

                          seller_id    revenue  rank
0  7c67e1448b00f6e969d365cea6b010ab  507166.91     1
1  1025f0e2d44d7041d6cf58b6550e0bfa  308222.04     2
2  4a3ca9315b744ce9f8e9374361493884  301245.27     3
3  1f50f920176fa81dab994f9023523100  290253.42     4
4  53243585a1d6dc2643021fd1853d8905  284903.08     5
5  da8622b14eb17ae2831f4ac5b9dab84a  272219.32     6
6  4869f7a5dfa277a7dca6462dcf3b52b2  264166.12     7
7  955fee9216a65b617aa5c0531780ce60  236322.30     8
8  fa1c13f2614d7b5c4749cbc52fecda94  206513.23     9
9  7e93a43ef30c4f03f38b393420bc753a  185134.21    10

# Calculate the moving average of order values for each customer over their order history

In [35]:
query = """ select customer_id, order_purchase_timestamp,
avg(payment) over(partition by customer_id order by order_purchase_timestamp
rows between 2 preceding and current row) as moving_avg
from
(select orders.customer_id, orders.order_purchase_timestamp,
payments.payment_value as payment
from payments join orders
on payments.order_id = orders.order_id) a """

cur.execute(query)
data = cur.fetchall()
df = pd.DataFrame(data, columns = ["customer_id","order_purchase_timestamp","avg_payment"])
df

                             customer_id order_purchase_timestamp  avg_payment
0       00012a2ce6f8dcda20d059ce98491703      2017-11-14 16:08:26   114.739998
1       000161a058600d5901f007fab4c27140      2017-07-16 09:40:32    67.410004
2       0001fd6190edaaf884bcaf3d49edf079      2017-02-28 11:06:43   195.419998
3       0002414f95344307404f0ace7a26f1d5      2017-08-16 13:09:20   179.350006
4       000379cdec625522490c315e70c7a9fb      2018-04-02 13:42:17   107.010002
...                                  ...                      ...          ...
103881  fffecc9f79fd8c764f843e9951b11341      2018-03-29 16:59:26    27.120001
103882  fffeda5b6d849fbd39689bb92087f431      2018-05-22 13:36:02    63.130001
103883  ffff42319e9b2d713724ae527742af25      2018-06-13 16:57:05   214.130005
103884  ffffa3172527f765de70084a7e53aae8      2017-09-02 11:53:32    45.500000
103885  ffffe8b65bbe3087b653a978c870db99      2017-09-29 14:07:03    18.370001

[103886 rows x 3 columns]

# Calculate the cumulative sales per month for each year

In [36]:
query = """ select years, months, sum(payment)
over(order by years,months) cumulative_sales from
(select year(orders.order_purchase_timestamp) as years,
month(orders.order_purchase_timestamp) as months,
round(sum(payments.payment_value),2) as payment from orders join payments
on orders.order_id = payments.order_id
group by years, months order by years, months) as a """

cur.execute(query)
data = cur.fetchall()
df = pd.DataFrame(data, columns = ["years","months","cumulative_sales"])
df

    years  months  cumulative_sales
0    2016       9            252.24
1    2016      10          59342.72
2    2016      12          59362.34
3    2017       1         197850.38
4    2017       2         489758.39
5    2017       3         939621.99
6    2017       4        1357410.02
7    2017       5        1950328.84
8    2017       6        2461605.22
9    2017       7        3053988.14
10   2017       8        3728384.46
11   2017       9        4456146.91
12   2017      10        5235824.79
13   2017      11        6430707.59
14   2017      12        7309109.07
15   2018       1        8424113.25
16   2018       2        9416576.59
17   2018       3       10576228.71
18   2018       4       11737014.19
19   2018       5       12890996.34
20   2018       6       13914876.84
21   2018       7       14981417.59
22   2018       8       16003842.91
23   2018       9       16008282.45
24   2018      10       16008872.12

# Calculate the year-over-year growth rate of total sales.

In [40]:
query = """ with a as(select year(orders.order_purchase_timestamp) as years,
round(sum(payments.payment_value),2) as payment from orders join payments
on orders.order_id = payments.order_id
group by years order by years)

select years, ((payment - lag(payment,1) over(order by years)) /  
lag(payment,1) over(order by years))*100 from a """

cur.execute(query)
data = cur.fetchall()
df = pd.DataFrame(data, columns = ["years","yoy % growth"])
df

   years  yoy % growth
0   2016           NaN
1   2017  12112.703761
2   2018     20.000924

# Calculate the retention rate of customers, defined as the percentage of customers who make another purchase within 6 months of their first purchase

In [7]:
query = """ with a as (select customers.customer_id,
min(orders.order_purchase_timestamp) first_order
from customers join orders
on customers.customer_id = orders.customer_id
group by customers.customer_id),

b as (select a.customer_id, count(distinct orders.order_purchase_timestamp) next_order
from a join orders
on orders.customer_id = a.customer_id
and orders.order_purchase_timestamp > first_order
and orders.order_purchase_timestamp < 
date_add(first_order, interval 6 month)
group by a.customer_id) 

select 100 * (count( distinct a.customer_id)/ count(distinct b.customer_id)) 
from a left join b 
on a.customer_id = b.customer_id """

cur.execute(query)
data = cur.fetchall()
df = pd.DataFrame(data)
df
#print("No customer purchase again in 6 months")

      0
0  None

# Identify the top 3 customers who spent the most money in each year.

In [8]:
query = """ select years, customer_id, payment, d_rank 
from
(select year(orders.order_purchase_timestamp) years, 
orders.customer_id,
sum(payments.payment_value) payment,
dense_rank() over(partition by year(orders.order_purchase_timestamp) 
order by sum(payments.payment_value) desc) d_rank
from orders join payments
on payments.order_id = orders.order_id
group by year(orders.order_purchase_timestamp), orders.customer_id) as a
where d_rank <=3 """

cur.execute(query)
data = cur.fetchall()
df = pd.DataFrame(data)
df

      0                                 1             2  3
0  2016  a9dc96b027d1252bbac0a9b72d837fc6   1423.550049  1
1  2016  1d34ed25963d5aae4cf3d7f3a4cda173   1400.739990  2
2  2016  4a06381959b6670756de02e07b83815f   1227.780029  3
3  2017  1617b1357756262bfa56ab541c47bc16  13664.080078  1
4  2017  c6e2731c5b391845f6800c97401a43a9   6929.310059  2
5  2017  3fd6777bbce08a352fddd04e4a7cc8f6   6726.660156  3
6  2018  ec5b2ba62e574342386871631fafd3fc   7274.879883  1
7  2018  f48d464a0baaea338cb25f816991ab1f   6922.209961  2
8  2018  e0a2412720e9ea4f26c1ac985f6a7358   4809.439941  3